import React from "react";
import styled, { keyframes } from "styled-components";
import Slider from "react-slick";
import "slick-carousel/slick/slick.css";

const shaking = keyframes`
  0%, 100% {
    transform: rotate(0);
    transform-origin: left bottom;
  }

  22% {
    transform: rotate(7.5deg);
    transform-origin: right bottom;
  }

  44% {
    transform: rotate(-7.5deg);
    transform-origin: left bottom;
  }

  66% {
    transform: rotate(3.75deg);
    transform-origin: right bottom;
  }

  77% {
    transform: rotate(-1.875deg);
    transform-origin: left bottom;
  }

  88% {
    transform: rotate(.9375deg);
    transform-origin: right bottom;
  }
`;

const MainSliderBlock = styled.div`
margin-top:3650px;
`
const MainSlider = () => {
  return <MainSliderBlock>
    <p>★메인슬라이드★</p>
    <p>스크롤 늘리기 <br /></p>
    <p>스크롤 늘리기 <br /></p>
    <p>스크롤 늘리기 <br /></p>
    <p>스크롤 늘리기 <br /></p>
    <p>스크롤 늘리기 <br /></p>
    <p>스크롤 늘리기 <br /></p>
    <p>스크롤 늘리기 <br /></p>
    <p>스크롤 늘리기 <br /></p>
    <p>스크롤 늘리기 <br /></p>
    <p>스크롤 늘리기 <br /></p>
    <p>스크롤 늘리기 <br /></p>
    <p>스크롤 늘리기 <br /></p>
    <p>스크롤 늘리기 <br /></p>
    <p>스크롤 늘리기 <br /></p>
    <p>스크롤 늘리기 <br /></p>
    <p>스크롤 늘리기 <br /></p>
    <p>스크롤 늘리기 <br /></p>
    <p>스크롤 늘리기 <br /></p>
    <p>스크롤 늘리기 <br /></p>
    <p>스크롤 늘리기 <br /></p>
    <p>스크롤 늘리기 <br /></p>
    <p>스크롤 늘리기 <br /></p>
    <p>스크롤 늘리기 <br /></p>
    <p>스크롤 늘리기 <br /></p>
    <p>스크롤 늘리기 <br /></p>
    <p>스크롤 늘리기 <br /></p>
    <p>스크롤 늘리기 <br /></p>
    <p>스크롤 늘리기 <br /></p>
    <p>스크롤 늘리기 <br /></p>
    <p>스크롤 늘리기 <br /></p>
    <p>스크롤 늘리기 <br /></p>
    <p>스크롤 늘리기 <br /></p>
    <p>스크롤 늘리기 <br /></p>
    <p>스크롤 늘리기 <br /></p>
    <p>스크롤 늘리기 <br /></p>
    <p>스크롤 늘리기 <br /></p>
    <p>스크롤 늘리기 <br /></p>
    <p>스크롤 늘리기 <br /></p>
    <p>스크롤 늘리기 <br /></p>
    <p>스크롤 늘리기 <br /></p>
    <p>스크롤 늘리기 <br /></p>
    <p>스크롤 늘리기 <br /></p>
    <p>스크롤 늘리기 <br /></p>
    <p>스크롤 늘리기 <br /></p>
    <p>스크롤 늘리기 <br /></p>
    <p>스크롤 늘리기 <br /></p>
    <p>스크롤 늘리기 <br /></p>
    <p>스크롤 늘리기 <br /></p>
    <p>스크롤 늘리기 <br /></p>
    <p>스크롤 늘리기 <br /></p>
    <p>스크롤 늘리기 <br /></p>
    <p>스크롤 늘리기 <br /></p>
    <p>스크롤 늘리기 <br /></p>
    <p>스크롤 늘리기 <br /></p>
    <p>스크롤 늘리기 <br /></p>
    <p>스크롤 늘리기 <br /></p>
    <p>스크롤 늘리기 <br /></p>
    <p>스크롤 늘리기 <br /></p>
    <p>스크롤 늘리기 <br /></p>
    <p>스크롤 늘리기 <br /></p>
    <p>스크롤 늘리기 <br /></p>
    <p>스크롤 늘리기 <br /></p>
    <p>스크롤 늘리기 <br /></p>
    <p>스크롤 늘리기 <br /></p>
    <p>스크롤 늘리기 <br /></p>
    <p>스크롤 늘리기 <br /></p>
    <p>스크롤 늘리기 <br /></p>
    <p>스크롤 늘리기 <br /></p>
    <p>스크롤 늘리기 <br /></p>
    <p>스크롤 늘리기 <br /></p>
    <p>스크롤 늘리기 <br /></p>
    <p>스크롤 늘리기 <br /></p>
    <p>스크롤 늘리기 <br /></p>
    <p>스크롤 늘리기 <br /></p>
    <p>스크롤 늘리기 <br /></p>
    <p>스크롤 늘리기 <br /></p>
    <p>스크롤 늘리기 <br /></p>
    <p>스크롤 늘리기 <br /></p>
    <p>스크롤 늘리기 <br /></p>
    <p>스크롤 늘리기 <br /></p>
    <p>스크롤 늘리기 <br /></p>
    <p>스크롤 늘리기 <br /></p>
    <p>스크롤 늘리기 <br /></p>
    <p>스크롤 늘리기 <br /></p>
    <p>스크롤 늘리기 <br /></p>
    <p>스크롤 늘리기 <br /></p>
    <p>스크롤 늘리기 <br /></p>
    <p>스크롤 늘리기 <br /></p>
    <p>스크롤 늘리기 <br /></p>
    <p>스크롤 늘리기 <br /></p>
    <p>스크롤 늘리기 <br /></p>
    <p>스크롤 늘리기 <br /></p>
    <p>스크롤 늘리기 <br /></p>
    <p>스크롤 늘리기 <br /></p>
    <p>스크롤 늘리기 <br /></p>
    <p>스크롤 늘리기 <br /></p>
    <p>스크롤 늘리기 <br /></p>
    <p>스크롤 늘리기 <br /></p>
    <p>스크롤 늘리기 <br /></p>
    <p>스크롤 늘리기 <br /></p>
    <p>스크롤 늘리기 <br /></p>
    <p>스크롤 늘리기 <br /></p>
    <p>스크롤 늘리기 <br /></p>
    <p>스크롤 늘리기 <br /></p>
    <p>스크롤 늘리기 <br /></p>
    <p>스크롤 늘리기 <br /></p>
    <p>스크롤 늘리기 <br /></p>
    <p>스크롤 늘리기 <br /></p>
    <p>스크롤 늘리기 <br /></p>
    <p>스크롤 늘리기 <br /></p>
    <p>스크롤 늘리기 <br /></p>
    <p>스크롤 늘리기 <br /></p>
    <p>스크롤 늘리기 <br /></p>
    <p>스크롤 늘리기 <br /></p>
    <p>스크롤 늘리기 <br /></p>
    <p>스크롤 늘리기 <br /></p>
    <p>스크롤 늘리기 <br /></p>
    <p>스크롤 늘리기 <br /></p>
    <p>스크롤 늘리기 <br /></p>
    <p>스크롤 늘리기 <br /></p>
    <p>스크롤 늘리기 <br /></p>
    <p>스크롤 늘리기 <br /></p>
    <p>스크롤 늘리기 <br /></p>
    <p>스크롤 늘리기 <br /></p>
    <p>스크롤 늘리기 <br /></p>
    <p>스크롤 늘리기 <br /></p>
    <p>스크롤 늘리기 <br /></p>
    <p>스크롤 늘리기 <br /></p>
    <p>스크롤 늘리기 <br /></p>
    <p>스크롤 늘리기 <br /></p>
    <p>스크롤 늘리기 <br /></p>
    <p>스크롤 늘리기 <br /></p>
    <p>스크롤 늘리기 <br /></p>
    <p>스크롤 늘리기 <br /></p>
    <p>스크롤 늘리기 <br /></p>
    <p>스크롤 늘리기 <br /></p>
    <p>스크롤 늘리기 <br /></p>
    <p>스크롤 늘리기 <br /></p>
    <p>스크롤 늘리기 <br /></p>
    <p>스크롤 늘리기 <br /></p>
    <p>스크롤 늘리기 <br /></p>
    <p>스크롤 늘리기 <br /></p>
    <p>스크롤 늘리기 <br /></p>
    <p>스크롤 늘리기 <br /></p>
    <p>스크롤 늘리기 <br /></p>
    <p>스크롤 늘리기 <br /></p>
    <p>스크롤 늘리기 <br /></p>
    <p>스크롤 늘리기 <br /></p>
    <p>스크롤 늘리기 <br /></p>
    <p>스크롤 늘리기 <br /></p>
    <p>스크롤 늘리기 <br /></p>
    <p>스크롤 늘리기 <br /></p>
    <p>스크롤 늘리기 <br /></p>
    <p>스크롤 늘리기 <br /></p>
    <p>스크롤 늘리기 <br /></p>
    <p>스크롤 늘리기 <br /></p>
    <p>스크롤 늘리기 <br /></p>
    <p>스크롤 늘리기 <br /></p>
    <p>스크롤 늘리기 <br /></p>
    <p>스크롤 늘리기 <br /></p>
    <p>스크롤 늘리기 <br /></p>
    <p>스크롤 늘리기 <br /></p>
    <p>스크롤 늘리기 <br /></p>
    <p>스크롤 늘리기 <br /></p>
    <p>스크롤 늘리기 <br /></p>
    <p>스크롤 늘리기 <br /></p>
    <p>스크롤 늘리기 <br /></p>
    <p>스크롤 늘리기 <br /></p>
    <p>스크롤 늘리기 <br /></p>
    <p>스크롤 늘리기 <br /></p>
    <p>스크롤 늘리기 <br /></p>
    <p>스크롤 늘리기 <br /></p>
    <p>스크롤 늘리기 <br /></p>
    <p>스크롤 늘리기 <br /></p>
    <p>스크롤 늘리기 <br /></p>
    <p>스크롤 늘리기 <br /></p>
    <p>스크롤 늘리기 <br /></p>
    <p>스크롤 늘리기 <br /></p>
    <p>스크롤 늘리기 <br /></p>
    <p>스크롤 늘리기 <br /></p>
    <p>스크롤 늘리기 <br /></p>
    <p>스크롤 늘리기 <br /></p>
    <p>스크롤 늘리기 <br /></p>
    <p>스크롤 늘리기 <br /></p>
    <p>스크롤 늘리기 <br /></p>
    <p>스크롤 늘리기 <br /></p>
    <p>스크롤 늘리기 <br /></p>
    <p>스크롤 늘리기 <br /></p>
    <p>스크롤 늘리기 <br /></p>
    <p>스크롤 늘리기 <br /></p>
    <p>스크롤 늘리기 <br /></p>
    <p>스크롤 늘리기 <br /></p>
    <p>스크롤 늘리기 <br /></p>
    <p>스크롤 늘리기 <br /></p>
    <p>스크롤 늘리기 <br /></p>
    <p>스크롤 늘리기 <br /></p>
    <p>스크롤 늘리기 <br /></p>
    <p>스크롤 늘리기 <br /></p>
    <p>스크롤 늘리기 <br /></p>
    <p>스크롤 늘리기 <br /></p>
    <p>스크롤 늘리기 <br /></p>
    <p>스크롤 늘리기 <br /></p>
    <p>스크롤 늘리기 <br /></p>
    <p>스크롤 늘리기 <br /></p>
    <p>스크롤 늘리기 <br /></p>
    <p>스크롤 늘리기 <br /></p>
    <p>스크롤 늘리기 <br /></p>
    <p>스크롤 늘리기 <br /></p>
    <p>스크롤 늘리기 <br /></p>
    <p>스크롤 늘리기 <br /></p>
    <p>스크롤 늘리기 <br /></p>
    <p>스크롤 늘리기 <br /></p>
    <p>스크롤 늘리기 <br /></p>
    <p>스크롤 늘리기 <br /></p>
    <p>스크롤 늘리기 <br /></p>
    <p>스크롤 늘리기 <br /></p>
    <p>스크롤 늘리기 <br /></p>
    <p>스크롤 늘리기 <br /></p>
    <p>스크롤 늘리기 <br /></p>
    <p>스크롤 늘리기 <br /></p>
    <p>스크롤 늘리기 <br /></p>
    <p>스크롤 늘리기 <br /></p>
    <p>스크롤 늘리기 <br /></p>
    <p>스크롤 늘리기 <br /></p>
    <p>스크롤 늘리기 <br /></p>
    <p>스크롤 늘리기 <br /></p>
    <p>스크롤 늘리기 <br /></p>
    <p>스크롤 늘리기 <br /></p>
    <p>스크롤 늘리기 <br /></p>
    <p>스크롤 늘리기 <br /></p>
    <p>스크롤 늘리기 <br /></p>
    <p>스크롤 늘리기 <br /></p>
    <p>스크롤 늘리기 <br /></p>
    <p>스크롤 늘리기 <br /></p>
    <p>스크롤 늘리기 <br /></p>
    <p>스크롤 늘리기 <br /></p>
    <p>스크롤 늘리기 <br /></p>
    <p>스크롤 늘리기 <br /></p>
    <p>스크롤 늘리기 <br /></p>
    <p>스크롤 늘리기 <br /></p>
    </MainSliderBlock>;
};

export default MainSlider;
